{
  "ir_version": "1.0",
  "project": "gogithub",
  "repository": "https://github.com/grokify/gogithub",
  "description": "A high-level Go module for interacting with the GitHub API",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.8.0",
      "date": "2026-02-01",
      "highlights": [
        {"description": "New `profile` package for comprehensive GitHub user contribution statistics"},
        {"description": "New `gogithub` CLI tool with progress bars and multiple output formats"},
        {"description": "Contributor statistics wrapper in `repo` package with 202 Accepted retry handling"},
        {"description": "Integration tests that run against real GitHub API when token is available"}
      ],
      "added": [
        {"description": "New `profile` package for user contribution statistics aggregation", "commit": "e57ae36"},
        {"description": "`profile.GetUserProfile()` - fetch comprehensive profile stats from multiple API sources", "commit": "e57ae36"},
        {"description": "`profile.UserProfile` type with commits, PRs, issues, reviews, repos, additions/deletions", "commit": "e57ae36"},
        {"description": "`profile.ContributionCalendar` type with weekly/daily grid and streak tracking", "commit": "e57ae36"},
        {"description": "`profile.ActivityTimeline` type with monthly activity breakdown", "commit": "e57ae36"},
        {"description": "`profile.ProgressInfo` type for stage-based progress reporting", "commit": "e57ae36"},
        {"description": "Calendar streak calculations: `LongestStreak()`, `CurrentStreak()`, `DaysWithContributions()`", "commit": "e57ae36"},
        {"description": "GitHub-style monthly summaries: `CommitSummary()`, `PRSummary()`, `IssueSummary()`", "commit": "e57ae36"},
        {"description": "`repo.ListContributorStats()` - list all contributors for a repository", "commit": "a2447e7"},
        {"description": "`repo.GetContributorStats()` - get stats for a specific contributor", "commit": "a2447e7"},
        {"description": "`repo.GetContributorSummary()` - get aggregated summary with first/last commit dates", "commit": "a2447e7"},
        {"description": "`repo.ContributorSummary` type with TotalCommits, TotalAdditions, TotalDeletions, FirstCommit, LastCommit", "commit": "a2447e7"},
        {"description": "Automatic 202 Accepted retry handling with exponential backoff for contributor stats", "commit": "a2447e7"},
        {"description": "New `gogithub` CLI tool built with Cobra", "commit": "653ed99"},
        {"description": "`gogithub profile` command for fetching user contribution statistics", "commit": "653ed99"},
        {"description": "`gogithub search-prs` command for searching open PRs by user", "commit": "653ed99"},
        {"description": "CLI progress display with Unicode progress bars and stage indicators", "commit": "653ed99"},
        {"description": "CLI output formats: summary, JSON, raw+aggregate JSON files", "commit": "653ed99"},
        {"description": "CLI can regenerate aggregate from raw file without API calls (`--input` flag)", "commit": "653ed99"},
        {"description": "Integration tests for profile package (8 tests)", "commit": "3aae93f"},
        {"description": "Integration tests for repo/contributors (6 tests)", "commit": "3aae93f"},
        {"description": "Integration tests automatically skip when GITHUB_TOKEN is not set", "commit": "3aae93f"}
      ],
      "dependencies": [
        {"description": "Added `github.com/spf13/cobra` v1.10.2 for CLI", "commit": "653ed99"}
      ],
      "documentation": [
        {"description": "Added `docs/guides/cli.md` - comprehensive CLI usage guide", "commit": "5f944e5"},
        {"description": "Added `docs/guides/profile.md` - comprehensive profile package guide", "commit": "7829ff2"},
        {"description": "Added `docs/guides/testing.md` - testing guide with integration test instructions", "commit": "8670f87"},
        {"description": "Expanded `docs/guides/auth.md` with detailed token requirements for fine-grained PATs", "commit": "14a05c4"},
        {"description": "Added `docs/releases/v0.8.0.md` release notes", "commit": "b13afc8"},
        {"description": "Updated mkdocs.yml navigation with Testing guide and v0.8.0 release notes", "commit": "451dbc9"},
        {"description": "Updated getting-started.md with link to testing guide", "commit": "451dbc9"},
        {"description": "Updated README.md directory structure with profile, repo/contributors, cmd/gogithub", "commit": "4b87f5b"}
      ],
      "chores": [
        {"description": "Updated .gitignore for CLI binary and MkDocs site directory", "commit": "1ba3f1e"}
      ],
      "tests": [
        {"description": "Added unit tests for `repo.ContributorSummary` type", "commit": "d9ea699"},
        {"description": "Added unit tests for `profile.UserProfile` (summary, top repos, filtering)", "commit": "96efa24"},
        {"description": "Added unit tests for `profile.ContributionCalendar` (levels, streaks, lookups)", "commit": "96efa24"},
        {"description": "Added unit tests for `profile.ActivityTimeline` (aggregation, summaries)", "commit": "96efa24"}
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-01-30",
      "highlights": [
        {"description": "**Breaking**: Upgraded `go-github` from v81 to v82"},
        {"description": "New `checks` package for GitHub Check Runs API (CI status, waiting for checks)"},
        {"description": "New `tag` package for Git tag operations (create, list, delete tags)"},
        {"description": "Extended `pr` package with review and approval functions"},
        {"description": "Extended `release` package with create/delete operations"}
      ],
      "breaking": [
        {"description": "Upgraded `github.com/google/go-github` from v81 to v82 - update your imports accordingly", "commit": "e2e20fc"}
      ],
      "added": [
        {"description": "New `checks` package for GitHub Check Runs API", "commit": "8cf1789"},
        {"description": "`checks.ListCheckRuns()` - list check runs for a commit SHA or branch", "commit": "8cf1789"},
        {"description": "`checks.ListCheckRunsForPR()` - list check runs for a pull request", "commit": "8cf1789"},
        {"description": "`checks.GetChecksStatus()` - get aggregate status (passed/failed/pending counts)", "commit": "8cf1789"},
        {"description": "`checks.AllChecksPassed()` - check if all runs completed successfully", "commit": "8cf1789"},
        {"description": "`checks.WaitForChecks()` - poll until all checks complete or timeout", "commit": "8cf1789"},
        {"description": "`checks.GetCheckRun()` - get a specific check run by ID", "commit": "8cf1789"},
        {"description": "`checks.ListCheckSuites()` - list check suites for a commit", "commit": "8cf1789"},
        {"description": "`checks.ChecksStatus` type with Total, Passed, Failed, Pending, AllPassed, AnyFailed, AnyPending fields", "commit": "8cf1789"},
        {"description": "New `tag` package for Git tag operations", "commit": "d331ec9"},
        {"description": "`tag.ListTags()` - list all tags for a repository with pagination", "commit": "d331ec9"},
        {"description": "`tag.GetTagSHA()` - get the commit SHA for a tag", "commit": "d331ec9"},
        {"description": "`tag.CreateTag()` - create an annotated tag", "commit": "d331ec9"},
        {"description": "`tag.CreateLightweightTag()` - create a lightweight tag (reference only)", "commit": "d331ec9"},
        {"description": "`tag.DeleteTag()` - delete a tag", "commit": "d331ec9"},
        {"description": "`tag.TagExists()` - check if a tag exists", "commit": "d331ec9"},
        {"description": "`tag.GetTagNames()` - get just the tag names from a repository", "commit": "d331ec9"},
        {"description": "`pr.ApprovePR()` - add an approval review to a pull request", "commit": "1ab80ba"},
        {"description": "`pr.RequestChangesPR()` - request changes on a pull request", "commit": "1ab80ba"},
        {"description": "`pr.CommentPR()` - add a comment review to a pull request", "commit": "1ab80ba"},
        {"description": "`pr.IsMergeable()` - check if a PR can be merged with detailed status", "commit": "1ab80ba"},
        {"description": "`pr.ListPRReviews()` - list all reviews on a pull request", "commit": "1ab80ba"},
        {"description": "`pr.MergeableState` type with Mergeable, State, Message fields", "commit": "1ab80ba"},
        {"description": "`release.CreateRelease()` - create a new release for a repository", "commit": "e09af77"},
        {"description": "`release.CreateReleaseSimple()` - create a release with common options", "commit": "e09af77"},
        {"description": "`release.DeleteRelease()` - delete a release by ID", "commit": "e09af77"},
        {"description": "`release.EditRelease()` - update a release", "commit": "e09af77"}
      ],
      "dependencies": [
        {"description": "Upgraded `github.com/google/go-github` from v81 to v82", "commit": "e2e20fc"}
      ],
      "documentation": [
        {"description": "Added v0.7.0 changelog entry with all new features", "commit": "0dde90f"},
        {"description": "Updated README directory structure with checks and tag packages", "commit": "0dde90f"},
        {"description": "Updated README with examples for checks, tag, and release packages", "commit": "0dde90f"},
        {"description": "Added docs/releases/v0.7.0.md with comprehensive release notes", "commit": "0dde90f"},
        {"description": "Updated go-github version reference from v81 to v82 in README", "commit": "0dde90f"}
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-01-17",
      "highlights": [
        {"description": "Added `graphql` package for GitHub GraphQL API support with user contribution statistics"},
        {"description": "Added MkDocs documentation site with Material theme, auto-deployed to GitHub Pages"},
        {"description": "Two approaches for commit statistics: quick stats (profile view) and detailed stats (additions/deletions)"}
      ],
      "added": [
        {"description": "New `graphql` package for GitHub GraphQL API", "commit": "6277bd5"},
        {"description": "`graphql.NewClient()` and `graphql.NewEnterpriseClient()` for GraphQL client creation", "commit": "6277bd5"},
        {"description": "`graphql.GetContributionStats()` for quick contribution statistics (like GitHub profile)", "commit": "6277bd5"},
        {"description": "`graphql.GetContributionStatsMultiYear()` for multi-year contribution queries", "commit": "6277bd5"},
        {"description": "`graphql.GetCommitStats()` for detailed commit stats with additions/deletions", "commit": "6277bd5"},
        {"description": "`graphql.GetCommitStatsByVisibility()` for stats split by public/private repositories", "commit": "6277bd5"},
        {"description": "`graphql.Visibility` type with `VisibilityAll`, `VisibilityPublic`, `VisibilityPrivate` constants", "commit": "6277bd5"},
        {"description": "`graphql.ContributionStats` type with monthly contribution breakdown", "commit": "6277bd5"},
        {"description": "`graphql.CommitStats` type with per-repo and per-month breakdowns including line changes", "commit": "6277bd5"},
        {"description": "MkDocs documentation site with Material theme at https://grokify.github.io/gogithub/", "commit": "88108f5"},
        {"description": "Documentation guides for all packages: auth, search, repo, pr, release, graphql, errors", "commit": "88108f5"},
        {"description": "GitHub Actions workflow for automatic documentation deployment to gh-pages", "commit": "88108f5"}
      ],
      "dependencies": [
        {"description": "Added `github.com/shurcooL/githubv4` for GitHub GraphQL API support", "commit": "6277bd5"},
        {"description": "Added `github.com/shurcooL/graphql` (indirect dependency)", "commit": "6277bd5"}
      ],
      "documentation": [
        {"description": "Added MkDocs configuration (mkdocs.yml) with Material theme", "commit": "88108f5"},
        {"description": "Added documentation home page (docs/index.md)", "commit": "88108f5"},
        {"description": "Added getting started guide (docs/getting-started.md)", "commit": "88108f5"},
        {"description": "Added API reference page with links to pkg.go.dev (docs/api-reference.md)", "commit": "88108f5"},
        {"description": "Added package guides: auth, search, repo, pr, release, graphql, errors", "commit": "88108f5"},
        {"description": "Added .github/workflows/docs.yaml for automatic gh-pages deployment", "commit": "88108f5"},
        {"description": "Updated README.md with documentation site link", "commit": "88108f5"}
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-17",
      "highlights": [
        {"description": "Added `QueryBuilder` for type-safe, fluent query construction"},
        {"description": "Preserved `Query` map type for flexibility with new GitHub search qualifiers"},
        {"description": "Removed `NewClientHTTP` - use `search.NewClient(github.NewClient(httpClient))` instead"}
      ],
      "added": [
        {"description": "`QueryBuilder` type with fluent builder pattern for constructing search queries"},
        {"description": "`NewQuery()` function to create a new `QueryBuilder`"},
        {"description": "`QueryBuilder.User()`, `Org()`, `Repo()` methods for scope filtering"},
        {"description": "`QueryBuilder.State()`, `StateOpen()`, `StateClosed()` methods for state filtering"},
        {"description": "`QueryBuilder.Is()`, `IsPR()`, `IsIssue()` methods for type filtering"},
        {"description": "`QueryBuilder.Author()`, `Assignee()`, `Label()`, `Mentions()`, `Involves()` methods"},
        {"description": "`QueryBuilder.Set(key, value)` escape hatch for any search qualifier"},
        {"description": "`QueryBuilder.Build()` method returning the underlying `Query` map"}
      ],
      "breaking": [
        {"description": "Removed `search.NewClientHTTP()` - use `search.NewClient(github.NewClient(httpClient))` instead"}
      ],
      "changed": [
        {"description": "`SearchOpenPullRequests` now uses `QueryBuilder` internally"},
        {"description": "Example command `cmd/searchuserpr` updated to use `QueryBuilder` pattern"}
      ],
      "removed": [
        {"description": "Removed `search.NewClientHTTP()` factory function"}
      ],
      "documentation": [
        {"description": "Added RELEASE_NOTES_v0.5.0.md with migration guide and usage examples"}
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-17",
      "highlights": [
        {"description": "Breaking change release: removed backward compatibility layer from v0.3.0"},
        {"description": "Relocated constants to more appropriate packages for better code organization"},
        {"description": "Improved error handling with `AuthError.Unwrap()` for error chain compatibility"},
        {"description": "Fixed `Query.Encode()` to produce deterministic output"}
      ],
      "breaking": [
        {"description": "Removed `Client` type from root package - use `auth.NewGitHubClient()` + subpackage clients"},
        {"description": "Removed `NewClient()` and `NewClientWithToken()` from root package - use `auth.NewGitHubClient()`"},
        {"description": "Removed type aliases (`Query`, `Issues`, `Issue`) from root package - import from `search` package"},
        {"description": "Removed re-exported constants (`ParamUser`, `ParamState`, etc.) from root package - import from `search` package"},
        {"description": "Removed wrapper methods (`SearchOpenPullRequests`, `SearchIssues`, `SearchIssuesAll`) from root package - use `search.Client` methods"},
        {"description": "Moved `UsernameDependabot` and `UserIDDependabot` from `search` to `auth` package"},
        {"description": "Moved `BaseURLRepoAPI` and `BaseURLRepoHTML` from `search` to root `gogithub` package"}
      ],
      "added": [
        {"description": "`AuthError.Unwrap()` method for Go 1.13+ error chain compatibility", "commit": "ca95de0"},
        {"description": "`AuthError.Err` field to wrap underlying errors", "commit": "ca95de0"}
      ],
      "changed": [
        {"description": "Root package now contains only package documentation and URL constants"},
        {"description": "Bot user constants (`UsernameDependabot`, `UserIDDependabot`) now in `auth` package"},
        {"description": "URL constants (`BaseURLRepoAPI`, `BaseURLRepoHTML`) now in root `gogithub` package"},
        {"description": "`search/issues.go` now imports URL constants from root package"}
      ],
      "fixed": [
        {"description": "`Query.Encode()` now produces deterministic output by sorting keys", "commit": "9be7777"}
      ],
      "removed": [
        {"description": "Removed `Client` type wrapper from root package"},
        {"description": "Removed `NewClient()` factory function from root package"},
        {"description": "Removed `NewClientWithToken()` factory function from root package"},
        {"description": "Removed `Query`, `Issues`, `Issue` type aliases from root package"},
        {"description": "Removed all re-exported constants from root package"},
        {"description": "Removed `SearchOpenPullRequests()`, `SearchIssues()`, `SearchIssuesAll()` wrapper methods from root package"}
      ],
      "documentation": [
        {"description": "Added RELEASE_NOTES_v0.4.0.md with migration guide"},
        {"description": "Updated ROADMAP.md marking v0.4.0 breaking changes as completed"}
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-17",
      "highlights": [
        {"description": "Major architecture refactor: reorganized into modular subpackages by operation type"},
        {"description": "Added comprehensive GitHub API operations for repositories, pull requests, and releases"},
        {"description": "Maintained backward compatibility with v0.2.x API (deprecated, will be removed in v0.4.0)"}
      ],
      "added": [
        {"description": "New `errors` package with standard error types (`ErrNotFound`, `ErrPermissionDenied`, `ErrRateLimited`, etc.) and `Translate` function", "commit": "fab4e3e"},
        {"description": "New `config` package with `Config` struct, `FromEnv`, `FromEnvWithConfig`, GitHub Enterprise support", "commit": "17b5e0e"},
        {"description": "New `pathutil` package with `Validate`, `Normalize`, `Join`, `Split`, `Dir`, `Base`, `Ext`, `HasPrefix` functions", "commit": "17b5e0e"},
        {"description": "New `auth` package with `NewGitHubClient`, `GetAuthenticatedUser`, `GetUser` functions", "commit": "758e477"},
        {"description": "New `search` package with `Client`, `SearchIssues`, `SearchIssuesAll`, `Query` builder, and `Issues` type with table generation", "commit": "2b9a557"},
        {"description": "New `repo` package with fork operations (`EnsureFork`, `GetDefaultBranch`)", "commit": "8c7104e"},
        {"description": "New `repo` package with branch operations (`CreateBranch`, `GetBranchSHA`, `DeleteBranch`, `BranchExists`)", "commit": "8c7104e"},
        {"description": "New `repo` package with commit operations (`CreateCommit`, `ReadLocalFiles`, `FileContent` type)", "commit": "8c7104e"},
        {"description": "New `repo` package with listing operations (`ListOrgRepos`, `ListUserRepos`, `GetRepo`, `ParseRepoName`)", "commit": "8c7104e"},
        {"description": "New `repo` package with batch operations (`Batch` type for atomic multi-file commits)", "commit": "8c7104e"},
        {"description": "New `pr` package with `CreatePR`, `GetPR`, `ListPRs`, `MergePR`, `ClosePR`, `AddPRReviewers`, `ListPRFiles`, `ListPRComments`", "commit": "fc65108"},
        {"description": "New `release` package with `ListReleases`, `ListReleasesSince`, `GetRelease`, `GetLatestRelease`, `GetReleaseByTag`, `ListReleaseAssets`", "commit": "c123ea5"},
        {"description": "New `cliutil` package with `GitStatusShortLines`, `GitRmDeletedLines`, `GitRmDeletedFile` helpers", "commit": "c123ea5"},
        {"description": "Example command `cmd/searchuserpr` for searching user pull requests", "commit": "c123ea5"}
      ],
      "changed": [
        {"description": "Reorganized codebase from flat package structure to modular subpackages by operation type", "commit": "04d3c80"},
        {"description": "Root package now provides backward-compatible re-exports delegating to subpackages", "commit": "04d3c80"},
        {"description": "Moved search functionality from `api_search.go` to `search/search.go`", "commit": "04d3c80"},
        {"description": "Moved constants from `constants.go` to `search/query.go`", "commit": "04d3c80"},
        {"description": "Moved issue types from `issue.go` to `search/issues.go`", "commit": "04d3c80"},
        {"description": "Moved example command from `pullrequest/cmd/searchuserpr` to `cmd/searchuserpr`", "commit": "04d3c80"}
      ],
      "deprecated": [
        {"description": "Root package `Client` type - use `auth.NewGitHubClient` and subpackage clients directly", "commit": "04d3c80"},
        {"description": "Root package `NewClient` function - use `auth.NewGitHubClient` instead", "commit": "04d3c80"},
        {"description": "Root package `NewClientWithToken` function - use `auth.NewGitHubClient` instead", "commit": "04d3c80"},
        {"description": "Root package type aliases (`Query`, `Issues`, `Issue`) - import from `search` package directly", "commit": "04d3c80"},
        {"description": "Root package constant re-exports (`ParamUser`, `ParamState`, etc.) - import from `search` package directly", "commit": "04d3c80"},
        {"description": "Root package wrapper methods (`SearchOpenPullRequests`, `SearchIssues`, `SearchIssuesAll`) - use `search.Client` methods directly", "commit": "04d3c80"}
      ],
      "removed": [
        {"description": "Removed `api_search.go` (functionality moved to `search/search.go`)", "commit": "04d3c80"},
        {"description": "Removed `constants.go` (functionality moved to `search/query.go`)", "commit": "04d3c80"},
        {"description": "Removed `issue.go` (functionality moved to `search/issues.go`)", "commit": "04d3c80"},
        {"description": "Removed `pullrequest/` directory (functionality moved to `pr/` and `cmd/`)", "commit": "04d3c80"}
      ],
      "dependencies": [
        {"description": "Upgraded `github.com/google/go-github` from v68 to v81", "commit": "8309e32"},
        {"description": "Updated Go version from 1.22 to 1.24.0", "commit": "8309e32"},
        {"description": "Updated indirect dependencies", "commit": "8309e32"}
      ],
      "documentation": [
        {"description": "Updated README with new modular package structure and usage examples", "commit": "272526d"},
        {"description": "Added RELEASE_NOTES_v0.3.0.md with comprehensive release documentation", "commit": "272526d"},
        {"description": "Added ROADMAP.json and ROADMAP.md with project roadmap and v0.4.0 deprecation plan", "commit": "0a59369"},
        {"description": "Added missing v0.3.0 packages to README documentation", "commit": "30fd20f"},
        {"description": "Added structured changelog (CHANGELOG.json and CHANGELOG.md)", "commit": "43c601e"}
      ]
    },
    {
      "version": "v0.2.5",
      "date": "2026-01-17",
      "dependencies": [
        {"description": "Bump `github.com/grokify/mogo` from 0.72.5 to 0.72.6", "commit": "4ca5253"}
      ]
    },
    {
      "version": "v0.2.4",
      "date": "2025-11-17",
      "dependencies": [
        {"description": "Bump `github.com/grokify/gocharts/v2` from 2.26.6 to 2.26.7", "commit": "0f4477a"}
      ]
    },
    {
      "version": "v0.2.3",
      "date": "2025-03-10",
      "changed": [
        {"description": "Update dependencies via `go mod`", "commit": "06c1ac2"}
      ]
    },
    {
      "version": "v0.2.2",
      "date": "2025-01-04",
      "changed": [
        {"description": "Dependency updates", "commit": "58e2699"}
      ]
    },
    {
      "version": "v0.2.1",
      "date": "2024-02-05",
      "changed": [
        {"description": "Dependency updates"}
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2023-12-17",
      "added": [
        {"description": "Initial GitHub search API support", "commit": "283c912"},
        {"description": "`Client` type wrapping `go-github` client", "commit": "283c912"},
        {"description": "`SearchIssues` and `SearchIssuesAll` methods", "commit": "d66e4f3"},
        {"description": "`Query` type for building search queries", "commit": "283c912"},
        {"description": "`Issues` type with table generation for reporting", "commit": "283c912"}
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2023-12-17",
      "added": [
        {"description": "Initial release", "commit": "43f8ecf"},
        {"description": "Basic GitHub API client wrapper", "commit": "43f8ecf"}
      ]
    }
  ]
}
